<template>
    <footer class="footer">
        <div class="container">
            <div class="footer__wrapper">
                <div class="footer__wrapper-contacts">
                    <h5 class="heading-5">Контакты</h5>
                    <div class="icons">
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
  <path fill-rule="evenodd" clip-rule="evenodd" d="M19.4717 4.43207C17.4761 2.43398 14.822 1.33304 11.9942 1.33203C6.16708 1.33203 1.42472 6.07385 1.42269 11.9024C1.42167 13.7656 1.90879 15.5843 2.83384 17.1871L1.33398 22.6654L6.93805 21.1954C8.48199 22.0379 10.2206 22.4814 11.9896 22.4819H11.9942C17.8202 22.4819 22.5632 17.7395 22.5652 11.911C22.5662 9.08622 21.4677 6.43069 19.4717 4.43258V4.43207ZM11.9942 20.6967H11.9906C10.4142 20.6962 8.86775 20.2724 7.51845 19.472L7.19757 19.2815L3.87194 20.1538L4.75948 16.9113L4.55064 16.5788C3.67121 15.1799 3.2064 13.5629 3.20741 11.9029C3.20944 7.0587 7.15094 3.11724 11.9978 3.11724C14.3446 3.11826 16.5505 4.03317 18.2095 5.6942C19.8686 7.35472 20.7814 9.56268 20.7804 11.91C20.7784 16.7547 16.8369 20.6962 11.9942 20.6962V20.6967ZM16.8136 14.1164C16.5495 13.9841 15.2509 13.3454 15.0086 13.2573C14.7663 13.1691 14.5904 13.125 14.4145 13.3896C14.2386 13.6542 13.7323 14.2492 13.5782 14.4251C13.4241 14.6015 13.27 14.6233 13.0059 14.491C12.7418 14.3587 11.8908 14.0799 10.8816 13.1802C10.0964 12.4797 9.5662 11.615 9.41215 11.3504C9.25805 11.0858 9.39593 10.9429 9.52768 10.8116C9.64628 10.693 9.79178 10.5029 9.92406 10.3488C10.0564 10.1947 10.1 10.0843 10.1882 9.90833C10.2764 9.73194 10.2323 9.5779 10.1664 9.44556C10.1005 9.31328 9.57233 8.01312 9.35182 7.48447C9.13738 6.96949 8.91947 7.03944 8.75776 7.03083C8.60366 7.02322 8.42779 7.0217 8.2514 7.0217C8.075 7.0217 7.78909 7.08759 7.54682 7.35219C7.30454 7.61675 6.62226 8.25592 6.62226 9.55554C6.62226 10.8552 7.56864 12.1118 7.70092 12.2881C7.8332 12.4645 9.56366 15.1322 12.2131 16.2767C12.8432 16.5489 13.3354 16.7116 13.7191 16.8333C14.3517 17.0345 14.9275 17.0061 15.3827 16.9382C15.8901 16.8622 16.9454 16.299 17.1654 15.6821C17.3853 15.0653 17.3853 14.5361 17.3195 14.4261C17.2536 14.3161 17.0772 14.2497 16.8131 14.1174L16.8136 14.1164Z" fill="#868686"/>
</svg><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
  <path d="M12.0007 22.6654C17.8917 22.6654 22.6673 17.8897 22.6673 11.9987C22.6673 6.10766 17.8917 1.33203 12.0007 1.33203C6.10961 1.33203 1.33398 6.10766 1.33398 11.9987C1.33398 17.8897 6.10961 22.6654 12.0007 22.6654Z" fill="#868686"/>
  <path fill-rule="evenodd" clip-rule="evenodd" d="M6.16157 11.8866C9.27112 10.5319 11.3446 9.63871 12.3821 9.20718C15.3444 7.97508 15.9599 7.76105 16.3611 7.75398C16.4493 7.75243 16.6466 7.7743 16.7744 7.878C16.8824 7.96556 16.912 8.08384 16.9262 8.16686C16.9405 8.24988 16.9581 8.439 16.9441 8.58677C16.7836 10.2734 16.089 14.3665 15.7356 16.2556C15.5861 17.0549 15.2917 17.3229 15.0066 17.3491C14.3872 17.4061 13.9168 16.9398 13.3169 16.5465C12.3781 15.9311 11.8477 15.548 10.9364 14.9475C9.8833 14.2535 10.566 13.8721 11.1662 13.2487C11.3233 13.0856 14.0525 10.6031 14.1053 10.3779C14.1119 10.3497 14.1181 10.2448 14.0557 10.1893C13.9933 10.1339 13.9013 10.1528 13.8348 10.1679C13.7407 10.1893 12.2409 11.1806 9.33557 13.1418C8.90987 13.4341 8.52429 13.5765 8.17881 13.5691C7.79796 13.5608 7.06535 13.3537 6.52072 13.1767C5.85272 12.9595 5.32181 12.8447 5.36804 12.476C5.39212 12.2839 5.65663 12.0874 6.16157 11.8866Z" fill="white"/>
</svg>
                    </div>
                    <p class="text">INFO@MPSYSTEM.IO</p>
                    <button>Оставить заявку</button>
                </div>
                <div class="footer__wrapper-service">
                    <h5 class="heading-5">Сервис</h5>
                    <p class="text">Политика конфиденциальности</p>
                    <p class="text">Пользовательское соглашение</p>
                    <p class="text">Публичная оферта</p>
                </div>
                <div class="footer__wrapper-infos">
                    <img src="/images/icons/logo.png" alt="">
                    <p class="text">ИП Аветисов Владимир Гарикович</p>
                    <p class="text">ИНН 772797733957, ОГРНИП 321774600162061</p>
                    <p class="text">Адрес: 427284, Респ Удмуртская, р-н Селтинский, д Бигеней, ул. Бигенейская, д 18</p>
                </div>
            </div>
        </div>
    </footer>
</template>
<style lang="scss" scoped>
    .footer{
        padding: 54px 138px;
        background-color: var(--footer-bg);
        margin-top: 140px;
        border-radius: 56px 56px 0 0;
        box-shadow: var(--box-shadow-footer);
        @media screen and (max-width: 880px) {
                padding: 64px 44px;
            }
        &__wrapper{
            width: 100%;
            display: flex;
            justify-content: start;
            align-items: start;
            flex-direction: row;
            flex-wrap: wrap;
            gap: 88px;
            color: var(--footer-text);
            @media screen and (max-width: 920px) {
                gap: 64px;
            }
            h5{
                color: var(--primary-black);
            }
            &-contacts{
                display: flex;
                justify-content: start;
                align-items: start;
                flex-direction: column;
                gap: 8px;
                width: calc(25% - 88px);
                min-width: 250px;
                flex-grow: 1;
                button{
                    margin-top: 4px;
                    @include button($background-color: transparent, $border: 2px solid var(--primary-black));
                }
            }
            &-service{
                width: calc(30% - 88px);
                display: flex;
                justify-content: start;
                align-items: start;
                flex-direction: column;
                gap: 8px;
                min-width: 250px;
                flex-grow: 1;
                h5{
                    margin-bottom: 4px;
                }
            }
            &-infos{
                width: calc(45% - 88px);
                display: flex;
                justify-content: start;
                align-items: start;
                flex-direction: column;
                gap: 8px;
                min-width: 250px;
                flex-grow: 1;
                img{
                    width: 170px;
                    margin-bottom: 8px;
                }
            }
        }
    }
</style>